[
  {"name": "HTML", "type": "Front End", "tech_type": "Language", "opinion": "We should all know HTML, it's logical. It's the skeleton of the web, without it there's nothing. Don't be fools denigrating HTML just for being a markup language, it's the most important language of the web."},
  {"name": "CSS", "type": "Front End", "tech_type": "Language", "opinion": "Same as above, personally I hate using pure CSS, my brain ends up exploding in spaghetti, but it's necessary to know it to understand how CSS frameworks work."},
  {"name": "JavaScript", "type": "Front End", "tech_type": "Language", "opinion": "Personally, I HATE JavaScript, it's a chaotic language with horrible syntax and unpredictable behavior. However, it is the most widely used programming language in the world, and it is essential for web development. I use it when I have no other option, but I always prefer to use TypeScript."},
  {"name": "Typescript", "type": "Front End", "tech_type": "Language", "opinion": "Strongly typed superset of JavaScript. I use it for large projects for safety and maintainability. Bro, I hate JavaScript."},
  {"name": "Python", "type": "Back End", "tech_type": "Language", "opinion": "Versatile and powerful. Ideal for backend, data analysis, and automation. The best for every day, I use it for everything, from scripts to web applications."},
  {"name": "PHP", "type": "Back End", "tech_type": "Language", "opinion": "Vanilla PHP is chaos, but with Laravel it's a pleasure. I use it for web development, especially with Laravel."},
  {"name": "React", "type": "Front End", "tech_type": "Framework", "opinion": "I love it! Total DIY. Modern framework for dynamic interfaces."},
  {"name": "Vue.js", "type": "Front End", "tech_type": "Framework", "opinion": "Very easy for beginners and integrable. I also like it."},
  {"name": "Angular", "type": "Front End", "tech_type": "Framework", "opinion": "I don't like it. I only used it briefly and didn't enjoy the experience."},
  {"name": "Tailwind CSS", "type": "Front End", "tech_type": "Framework", "opinion": "Excellent, customizable, and fast for UI. Main CSS framework in all my projects."},
  {"name": "Bootstrap", "type": "Front End", "tech_type": "Framework", "opinion": "Not bad, only for serious and lightweight projects, but I prefer Tailwind CSS."},
  {"name": "Foundation", "type": "Front End", "tech_type": "Framework", "opinion": "Classic style, few components, but I like it for simple desktop web apps."},
  {"name": "FontAwesome", "type": "Front End", "tech_type": "Library", "opinion": "Great for icons, easy to use and widely supported. Main icon library."},
  {"name": "Axios", "type": "Front End", "tech_type": "Library", "opinion": "Simple and effective for HTTP requests. I use it for APIs in frontend. Fetch is mid."},
  {"name": "Chart.js", "type": "Front End", "tech_type": "Library", "opinion": "Powerful and flexible for interactive charts. I use it for data visualization."},
  {"name": "Flask", "type": "Back End", "tech_type": "Framework", "opinion": "Lightweight and flexible. Perfect for small/medium Python projects. This site is made with Flask."},
  {"name": "Laravel", "type": "Back End", "tech_type": "Framework", "opinion": "I love it! Elegant, my main framework for EVERYTHING. Go-to for PHP and all projects."},
  {"name": "Eloquent", "type": "Back End", "tech_type": "ORM", "opinion": "Elegant and powerful. Ideal for databases in Laravel."},
  {"name": "SQLAlchemy", "type": "Back End", "tech_type": "ORM", "opinion": "Powerful and flexible. I use it for databases in Flask."},
  {"name": "MySQL / MariaDB", "type": "Database / Cache", "tech_type": "Database", "opinion": "Reliable and widely used. Ideal for structured data and complex queries."},
  {"name": "PostgreSQL", "type": "Database / Cache", "tech_type": "Database", "opinion": "Advanced and powerful database."},
  {"name": "Oracle", "type": "Database / Cache", "tech_type": "Database", "opinion": "I only used it at university. It's fine, but the cost is not worth it. Academic experience."},
  {"name": "MongoDB", "type": "Database / Cache", "tech_type": "Database", "opinion": "Flexible and scalable. Perfect for unstructured data and rapid development."},
  {"name": "Redis", "type": "Database / Cache", "tech_type": "Database", "opinion": "Fast and efficient. I use it for cache and real-time apps."},
  {"name": "Docker", "type": "DevOps", "tech_type": "Platform", "opinion": "Double-edged sword: if it works, great; if not, you're screwed. But I love it anyway."},
  {"name": "Docker Compose", "type": "DevOps", "tech_type": "Tool", "opinion": "Great for managing multiple containers. I orchestrate all my services with it."},
  {"name": "Jenkins", "type": "DevOps", "tech_type": "Tool", "opinion": "Highly customizable and used to automate builds and deployments. I use it for CI/CD pipelines."},
  {"name": "GitHub Actions", "type": "DevOps", "tech_type": "Tool", "opinion": "Automation of builds and deployments directly from GitHub."},
  {"name": "Bash Scripts", "type": "DevOps", "tech_type": "Language", "opinion": "I prefer to write my own scripts to automate tasks. I don't like to depend on third-party tools."},
  {"name": "cPanel", "type": "DevOps", "tech_type": "Platform", "opinion": "I don't like it, I never use it. I don't like programs that make things too easy."}
]
